src/cf/DataProcessors/ОбработкиНалоговИОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ОбработкиНалоговИОтчетности</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеКалендаря</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендарьПодготовкиОтчетности</v8:Type>
						<v8:Type>cfg:CatalogRef.КалендарьПерсональныхЗадачОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСобытийКалендаря</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/ОбработкиНалоговИОтчетности/Forms/РасчетПоСтраховымВзносам/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ШиринаКнопкиОтправить;

&НаКлиенте
Перем КонтекстЭДОКлиент Экспорт;

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		
		Если ЗначениеЗаполнено(Параметры.Организация) Тогда
			Объект.Организация = Параметры.Организация;
		Иначе
			Организация = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнаяОрганизация");
			Если Не ЗначениеЗаполнено(Организация) Тогда
				Организация = Справочники.Организации.ПредопределеннаяОрганизация();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СобытиеКалендаря) Тогда
		Объект.СобытиеКалендаря = Параметры.СобытиеКалендаря;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СостояниеСобытия) Тогда
		Если ЗначениеЗаполнено(Параметры.СостояниеСобытия) Тогда
			Объект.СостояниеСобытия = Параметры.СостояниеСобытия;
		Иначе
			Объект.СостояниеСобытия = КалендарьОтчетности.ПолучитьСостояниеСобытияКалендаря(
			Объект.Организация,
			Объект.СобытиеКалендаря);
			
		КонецЕсли;
	КонецЕсли;
	
	
	Если НЕ ЗначениеЗаполнено(ДокументОтчетности) Тогда
		Если ЗначениеЗаполнено(Параметры.ДокументОтчетности) Тогда
			ДокументОтчетности = Параметры.ДокументОтчетности;
		Иначе
			ДокументОтчетности = РегламентированнаяОтчетностьУСН.ПолучитьДокументРегламентированнойОтчетностиПоСобытиюКалендаря(Объект.Организация, Объект.СобытиеКалендаря);
		КонецЕсли;
	КонецЕсли;
	
	Если РегламентированнаяОтчетностьПереопределяемый.ДоступнаОтправкаРегламентированногоОтчета() Тогда
		ТекущийСпособСдачи = 1;
	Иначе
		Элементы.ОтправитьОтчетностьЧерезИнтернетВыбор.Видимость = Ложь;
		ТекущийСпособСдачи = 2;
	КонецЕсли;
	
	ПереключитьСпособСдачи(ТекущийСпособСдачи);
	
	// Обработка ситуации, если статус отправки "отправлен", то проверяем, нет ли каких-нибудь изменений
	Если Объект.СостояниеСобытия = Перечисления.СостоянияСобытийКалендаря.ПолучитьПодтверждение Тогда
		
		РегламентированнаяОтчетностьУСН.ОбновитьСтатусыОтправленныхОтчетов();
		
		Объект.СостояниеСобытия = КалендарьОтчетности.ПолучитьСостояниеСобытияКалендаря(
		Объект.Организация,
		Объект.СобытиеКалендаря);
	КонецЕсли;
	
	ДатаСменыСостояния = КалендарьОтчетности.ПолучитьДатуСменыСостояния(Объект.Организация, Объект.СобытиеКалендаря);
	
	Заголовок = Объект.СобытиеКалендаря.Наименование;
	
	ИспользуетсяДКО = Истина;
	
	Если РаботаВМоделиСервиса.ЭтоДемонстрационнаяИнформационнаяБаза() Тогда
		Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Отправить (в демо не доступно)'");
		Элементы.ОтправитьВКонтролирующийОрган.Доступность = Ложь
	Иначе	
		ПроверитьВозможностьОтправки();
	КонецЕсли;
	
	ДатыСобытия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.СобытиеКалендаря, "ДатаНачалаДокументов,ДатаОкончанияДокументов");
	
	ПериодЗадачиПредставление = ПредставлениеПериода(
	ДатыСобытия.ДатаНачалаДокументов,
	КонецДня(ДатыСобытия.ДатаОкончанияДокументов),
	"ФП=Истина");
	
	РегламентированнаяОтчетностьКлиентСервер.ПриИнициализацииФормыРегламентированногоОтчета(ЭтаФорма, "ФНС");
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Успех";   
	
	
	ПараметрыВажногоСообщения.Сообщение = НСтр(                                                                                
	"ru = 'Задача подготовки и сдачи отчета ""Расчет по страховым взносам"" выполнена успешно. 
	|При необходимости ее можно найти в архиве (Календарь налогов и отчетности - группа ""Архив"").
	|Отчет Расчет по страховым взносам рассчитывается и предоставляется один раз в квартал, не позднее 30-го числа месяца, следующего за отчетным.'");
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Элементы.СтраницаДекларация.ТекущаяСтраница.Заголовок, ПериодЗадачиПредставление);
	ПараметрыВажногоСообщения.КраткоеПредставление = Заголовок;
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.БаннерЗадачаВыполнена.Имя);
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Информация";
	ПараметрыВажногоСообщения.Сообщение = НСтр(                                                                                
	"ru = 'Отчет Расчет по страховым взносам отправлен по электронным каналам связи. 
	|Налоговая теперь должна ее проверить.
	|Если будут выявлены ошибки, в календаре налогов и отчетности появится соответствующее уведомление.'");
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Элементы.СтраницаДекларация.ТекущаяСтраница.Заголовок, ПериодЗадачиПредставление);
	ПараметрыВажногоСообщения.КраткоеПредставление = Заголовок;
	ПараметрыВажногоСообщения.ПараметрыДействия = Новый Массив;
	Действие = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	Действие.Заголовок = НСтр("ru = 'Проверить наличие подтверждения'");
	Действие.ИмяКоманды = "ОбновитьСтатус";
	Действие.Обработчик = "ОбновитьСтатус";
	ПараметрыВажногоСообщения.ПараметрыДействия.Добавить(Действие);
	Действие = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	Действие.Заголовок = НСтр("ru = 'История обмена'");
	Действие.ИмяКоманды = "ИсторияОбмена";
	Действие.Обработчик = "ИсторияОбмена";
	ПараметрыВажногоСообщения.ПараметрыДействия.Добавить(Действие);
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.БаннерОжидатьПодтверждения.Имя);
	
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Ошибка";
	ПараметрыВажногоСообщения.Сообщение = НСтр(                                                                                
	"ru = 'Отчет Расчет по страховым взносам не принят. Причины ошибок представлены ниже. Исправьте указанные ошибки и попробуйте отправить отчет заново.'");
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Элементы.СтраницаДекларация.ТекущаяСтраница.Заголовок, ПериодЗадачиПредставление);
	ПараметрыВажногоСообщения.КраткоеПредставление = Заголовок; 
	Действие = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	Действие.Заголовок = НСтр("ru = 'Причины отказа, ошибки, комментарии'");
	Действие.ИмяКоманды = "ОшибкиСдачи";
	Действие.Обработчик = "ОшибкиСдачи";
	ПараметрыВажногоСообщения.ПараметрыДействия = Действие;
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.БаннерОзнакомится.Имя);
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Успех";
	ПараметрыВажногоСообщения.Сообщение = НСтр(                                                                                
	"ru = 'Отчет Расчет по страховым взносам  успешно принят в налоговую. Для завершения задачи нажмите кнопку ""Готово"".'");
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Элементы.СтраницаДекларация.ТекущаяСтраница.Заголовок, ПериодЗадачиПредставление);
	ПараметрыВажногоСообщения.КраткоеПредставление = Заголовок;
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.БаннерЗадачаВыполнена1.Имя);
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Предупреждение";
	ПараметрыВажногоСообщения.Сообщение = НСтр(                                                                                
	"ru = 'Для отправки отчетности онлайн необходимо заполнить заявление на подключение к 1С-Отчетности.'");
	ПараметрыВажногоСообщения.КраткоеПредставление = "Отсутствует заявление на подключение к 1С-Отчетности";
	ПараметрыДействия = ОбщегоНазначения.ПараметрыДействияВажногоСообщения(); 
	ПараметрыДействия.ИмяКоманды = "ОформитьЗаявку";
	ПараметрыДействия.Обработчик = "ОформитьЗаявку";
	ПараметрыДействия.Заголовок  = "Подключить 1С-Отчетность";
	ПараметрыВажногоСообщения.ПараметрыДействия = ПараметрыДействия;
	
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.БаннерПодключитьОтчетнность.Имя);
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьТекущуюЗакладку(ЭтаФорма, Объект);
	УстановитьЗаголовокФормыПоТекущейСтранице();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОткрытииПослеПолученияКонтекста", ЭтаФорма);
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);
	УправлениеКоманднойПанелиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииПослеПолученияКонтекста(Результат, ДополнительныеПараметры) Экспорт
	
	КонтекстЭДОКлиент = Результат.КонтекстЭДО;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда,
	НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	ОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда,
		НавигационнаяСсылка, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПрикрепленаДоверенность" И Параметр = Объект.Организация Тогда
		Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Идет проверка доверенности'");
	ИначеЕсли ИмяСобытия = "ИзмененаЗаявкаЭДО" Тогда
		Если Параметр.Организация = Объект.Организация Тогда
			Если Параметр.ЕстьАктуальнаяЗаявка Тогда
				Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Отправить'");
				Элементы.ОтправитьВКонтролирующийОрган.Доступность = Истина;
				Элементы.БаннерПодключитьОтчетнность.Видимость = Ложь;
			Иначе
				Элементы.ОтправитьВКонтролирующийОрган.Доступность = Ложь;
				Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Отправить (нет заявки)'");
				Элементы.БаннерПодключитьОтчетнность.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ИзмененаТекущаяОрганизация" Тогда
		Если Окно.Основное Тогда
			ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("e1cib/navigationpoint/НалогиИОтчетность");
		Иначе
			Закрыть();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ИзменениеСостоянияСобытияКалендаря" Тогда
		Если Параметр = Объект.СобытиеКалендаря
			И Источник <> ЭтаФорма
			И Окно<> Неопределено
			И Не Окно.Основное Тогда
			Закрыть();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "СозданоЗаявлениеНаПодключениеКЭДОСКО" Тогда
		ПроверитьВозможностьОтправки();
	КонецЕсли;
	
КонецПроцедуры



///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОтправитьОтчетностьЧерезИнтернетВыбор(Команда)
	
	Если ТекущийСпособСдачи = 2 Тогда
		ПереключитьСпособСдачи(1);
	Иначе
		ШиринаКнопкиОтправить = 5;
		ПодключитьОбработчикОжидания("АнимацияОтправить", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодатьОтчетностьСамостоятельно(Команда)
	
	Если ТекущийСпособСдачи = 1 Тогда
		ПереключитьСпособСдачи(2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлВыгрузки(Команда)
	
	РегламентированнаяОтчетностьУСНКлиент.СохранитьФайлВыгрузкиОтчетности(ДокументОтчетности);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспечататьДекларацию(Команда)
	
	РегламентированнаяОтчетностьУСНКлиент.РаспечататьМашиночитаемыйРегламентированныйОтчет(ДокументОтчетности);
	
КонецПроцедуры

&НаКлиенте
Процедура ОшибкиСдачи(Команда)
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ПоказатьПротоколОтправки(ДокументОтчетности);
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьЗаявку(Команда)
	
	ОткрытьФорму("Обработка.ДокументооборотСКонтролирующимиОрганами.Форма.МастерФормированияЗаявкиНаПодключениеУпрощенное",
		Новый Структура("Организация", Объект.Организация),,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатус(Команда)
	
	ВыбранныеОрганизации = Новый Массив(1);
	ВыбранныеОрганизации[0] = Объект.Организация;	
	
	
	Если ВыбранныеОрганизации.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Учетная запись не выбрана.");
		Возврат;
	ИначеЕсли ВыбранныеОрганизации.Количество() = 1 Тогда
		ТекстВопроса = НСтр("ru='Информация будет запрошена по всем отчетам, ожидающим подтверждения'");
	Иначе
		ТекстВопроса = "Произвести обмен сообщениями по выбранным учетным записям?";
	КонецЕсли;
	
	ПоказатьПредупреждение(,ТекстВопроса);
	
	
	// получаем массив учетных записей по массиву организаций
	ВыбранныеУчетныеЗаписи = ПолучитьМассивУчетныхЗаписей(ВыбранныеОрганизации);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОбменаПоУчетнойЗаписиЗавершение", ЭтаФорма);
	
	// последовательно для каждой учетной записи производим обмен
	Для Каждого ВыбраннаяУчетнаяЗапись Из ВыбранныеУчетныеЗаписи Цикл
		КонтекстЭДОКлиент.ОсуществитьОбменПоУчетнойЗаписи(ОписаниеОповещения, ВыбраннаяУчетнаяЗапись);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОбменаПоУчетнойЗаписиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПроверитьСтатусОтчета();        
	УстановитьЗаголовокФормыПоТекущейСтранице();
	УправлениеКоманднойПанелиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСтатусОтчета()
	
	РегламентированнаяОтчетностьУСН.ОбновитьСтатусыОтправленныхОтчетов();
	
	Объект.СостояниеСобытия = КалендарьОтчетности.ПолучитьСостояниеСобытияКалендаря(
	Объект.Организация,
	Объект.СобытиеКалендаря);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивУчетныхЗаписей(ВыбранныеОрганизации)
	
	// получаем массив учетных записей по массиву организаций
	КонтекстЭДО = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	Возврат КонтекстЭДО.УчетныеЗаписиПоОрганизациям(ВыбранныеОрганизации);
	
КонецФункции

&НаКлиенте
Процедура ИсторияОбмена(Команда)
	ПоказатьЗначение(,ПолучитьЦиклОбмена(ДокументОтчетности));
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦиклОбмена(Док) 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЦиклыОбмена.Ссылка
	|ИЗ
	|	Справочник.ЦиклыОбмена КАК ЦиклыОбмена
	|ГДЕ
	|	ЦиклыОбмена.Предмет = &ДокРО
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦиклыОбмена.ДатаСоздания УБЫВ");
	Запрос.УстановитьПараметр("ДокРО", Док);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции






// -----------------------------------------------------------------------------
// События переходов

&НаКлиенте
Процедура ПереходЗаполнение(Команда)
	
	Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Заполнить");
	
	КалендарьОтчетности.ЗаписатьСостояниеСобытияКалендаря(
	Объект.Организация,
	Объект.СобытиеКалендаря,
	Объект.СостояниеСобытия,
	"");
	
	Оповестить("ИзменениеСостоянияСобытияКалендаря", Объект.СобытиеКалендаря, ЭтаФорма);
	ПараметрыФормы = Новый Структура("Организация,СобытиеКалендаря", Объект.Организация,Объект.СобытиеКалендаря);
	
	КалендарьОтчетностиКлиентУНФ.ОткрытьФормуНачалаЗаполнения(ЭтаФорма,ПараметрыФормы);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереходКОтчетуРСВ(Элемент)
	
	Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Отправить");
	
	ЗафиксироватьПереходкОтправке(Объект.Организация, Объект.СобытиеКалендаря, Объект.СостояниеСобытия);
	
	ДатаСменыСостояния = ТекущаяДата();
	
	Элементы.СтраницаДекларация.ТекущаяСтраница = Элементы.РасчетПоСтраховымВзносам;
	ПереключитьСпособСдачи(ТекущийСпособСдачи);
	
	УстановитьЗаголовокФормыПоТекущейСтранице();
	
	Оповестить("ИзменениеСостоянияСобытияКалендаря", Объект.СобытиеКалендаря, ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗафиксироватьПереходкОтправке(Организация, Событие, Состояние)
	
	КалендарьОтчетности.ЗаписатьСостояниеСобытияКалендаря(
	Организация,
	Событие,
	Состояние,
	"");
	
	
	ЗаписьКалендаря = Справочники.ЗаписиКалендаряПодготовкиОтчетности.ПолучитьЗаписьКалендаря(Организация, Событие);
	Если ЗаписьКалендаря <> Неопределено Тогда
		ОбъектЗаписьКалендаря = ЗаписьКалендаря.ПолучитьОбъект();
		ОбъектЗаписьКалендаря.Завершено = Ложь;
		ОбъектЗаписьКалендаря.Записать();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПереходВыполнил(Команда)
	
	оп = Новый ОписаниеОповещения("ОповещениеДекларацияПринята", ЭтотОбъект);
	ПоказатьВопрос(оп, НСтр("ru='ИФНС приняла Расчет по страховым взносам?'"), РежимДиалогаВопрос.ДаНет);
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеДекларацияПринята(Ответ, Параметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Завершено");
	
	КалендарьОтчетности.ЗавершитьСобытиеКалендаряОтчетности(
	Объект.Организация,
	Объект.СобытиеКалендаря,
	"");
	
	ДатаСменыСостояния = ТекущаяДата();	
	
	Элементы.СтраницаДекларация.ТекущаяСтраница = Элементы.ЗадачаВыполнена;
	УстановитьЗаголовокФормыПоТекущейСтранице();
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.ЗаписиКалендаряПодготовкиОтчетности"));
	Оповестить("Запись_ЗаписиКалендаряПодготовкиОтчетности");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРСВ(Команда)
	
	ПоказатьЗначение(,ДокументОтчетности);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтчетность(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОтветеНаВопросОЗаполнении",
	ЭтаФорма);
	
	ПоказатьВопрос(ОписаниеОповещения,
	НСтр("ru='Вы подтверждаете, что Расчет по страховым взносам заполнен полностью и корректно?'"), РежимДиалогаВопрос.ДаНет);
	
	УправлениеКоманднойПанелиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОтветеНаВопросОЗаполнении(РезультатВопроса, ДопПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	// регистрируем заявку на отправку
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправкаВКонтролирующийОрганПослеОтправки", ЭтаФорма);
	
	Если ИспользуетсяДКО Тогда
		КонтекстЭДОКлиент.ОтправкаРегламентированногоОтчетаВФНС(ДокументОтчетности, ОписаниеОповещения);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаВКонтролирующийОрганПослеОтправки(РезультатОтправки, ДополнительныеПараметры) Экспорт
	
	Если РезультатОтправки Тогда
		ОтправитьОтчетностьНаСервере();
		Элементы.СтраницаДекларация.ТекущаяСтраница = Элементы.ЗадачаОжидатьПодтверждения;
		УстановитьЗаголовокФормыПоТекущейСтранице();
	КонецЕсли;
	
	УправлениеКоманднойПанелиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПодтверждениеОтправки(Ответ, Параметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	// регистрируем заявку на отправку
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправкаВКонтролирующийОрганПослеОтправки", ЭтаФорма);
	
	Если ИспользуетсяДКО Тогда
		КонтекстЭДОКлиент.ОтправкаРегламентированногоОтчетаВФНС(ДокументОтчетности, ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДекорацияЗаявлениеОтправленоОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОбновитьСтатус" Тогда
		оп = Новый ОписаниеОповещения("ОбновлениеСтатусаЗавершение", ЭтаФорма);
		КонтекстЭДОКлиент.ОбновитьСтатусыЗаявленийАбонентов_ИзФормыСписка(, ЭтаФорма.УникальныйИдентификатор, оп,Объект.Организация);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ПерейтиКСпискуЗаявлений" Тогда
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьФормуСпискаЗаявленийНаПодключение(Объект.Организация);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеСтатусаЗавершение(Результат, ДопПараметры) Экспорт
	ПроверитьВозможностьОтправки();
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Завершено");
	
	КалендарьОтчетности.ЗавершитьСобытиеКалендаряОтчетности(
	Объект.Организация,
	Объект.СобытиеКалендаря,
	"");
	
	
	ДатаСменыСостояния = ТекущаяДата();
	
	Элементы.СтраницаДекларация.ТекущаяСтраница = Элементы.ЗадачаВыполнена;
	УстановитьЗаголовокФормыПоТекущейСтранице();     
	УправлениеКоманднойПанелиФормы();
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.ЗаписиКалендаряПодготовкиОтчетности"));
	Оповестить("Запись_ЗаписиКалендаряПодготовкиОтчетности");
КонецПроцедуры


// Конец событий переходов
// -----------------------------------------------------------------------------

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ПроверитьВозможностьОтправки()
	
	Если НЕ ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "УчетнаяЗаписьОбмена")) Тогда
		// Возможно заявление отправлено, но еще не одобрено
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявлениеАбонентаСпецоператораСвязи.Ссылка
		|ИЗ
		|	Документ.ЗаявлениеАбонентаСпецоператораСвязи КАК ЗаявлениеАбонентаСпецоператораСвязи
		|ГДЕ
		|	НЕ ЗаявлениеАбонентаСпецоператораСвязи.ПометкаУдаления
		|	И ЗаявлениеАбонентаСпецоператораСвязи.Организация = &Организация
		|	И ЗаявлениеАбонентаСпецоператораСвязи.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявленияАбонентаСпецоператораСвязи.Отправлено)";
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Если Запрос.Выполнить().Пустой() Тогда
			Элементы.ОтправитьВКонтролирующийОрган.Доступность = Ложь;
			Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Отправить (нет заявки)'");
			Элементы.БаннерПодключитьОтчетнность.Видимость = Истина;
			Элементы.ДекорацияЗаявлениеОтправлено.Видимость = Ложь;
		Иначе
			
			Элементы.ОтправитьВКонтролирующийОрган.Доступность = Ложь;
			Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Отправить (нет заявки)'");
			Элементы.БаннерПодключитьОтчетнность.Видимость = Ложь;
			Элементы.ДекорацияЗаявлениеОтправлено.Видимость = Истина;
		КонецЕсли;
	Иначе
		Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Отправить'");
		Элементы.ОтправитьВКонтролирующийОрган.Доступность = Истина;
		Элементы.БаннерПодключитьОтчетнность.Видимость = Ложь;
		Элементы.ДекорацияЗаявлениеОтправлено.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьОтчетностьНаСервере()
	
	Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.ПолучитьПодтверждение");
	
	КалендарьОтчетности.ЗаписатьСостояниеСобытияКалендаря(
	Объект.Организация,
	Объект.СобытиеКалендаря,
	Объект.СостояниеСобытия,
	ДокументОтчетности);
	
	ДатаСменыСостояния = ТекущаяДатаСеанса();
	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокФормыПоТекущейСтранице()
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Элементы.СтраницаДекларация.ТекущаяСтраница.Заголовок, ПериодЗадачиПредставление);
	РегламентированнаяОтчетностьУСНКлиентСервер.УстановитьЗаголовокФормыЗадачи(ЭтаФорма, Объект.Организация); 
	УправлениеКоманднойПанелиФормы();
	
КонецПроцедуры


// 1 - через представителя; 2 - самостоятельно
&НаСервере
Процедура ПереключитьСпособСдачи(СпособСдачи)
	
	Если НЕ РегламентированнаяОтчетностьПереопределяемый.ДоступнаОтправкаРегламентированногоОтчета() Тогда
		СпособСдачи = 2;
	КонецЕсли;
	
	Если СпособСдачи = 1 Тогда 
		Элементы.ПереходВыполнил.Видимость = Ложь;   
		Элементы.ОтправитьВКонтролирующийОрган.Видимость = Истина; 
		Элементы.ОтправитьВКонтролирующийОрган.КнопкаПоУмолчанию = Истина; 
		Элементы.ОтправитьВКонтролирующийОрган.Важность = ВажностьКнопки.Главная;
		
		
		Элементы.ГруппаПодачиЧерезИнтернетОписание.Видимость = Истина;
		Элементы.ГруппаПодачиСамостоятельноОписание.Видимость = Ложь;
	Иначе
		Элементы.ПереходВыполнил.Видимость = Истина;    
		Элементы.ПереходВыполнил.КнопкаПоУмолчанию = Истина;      
		Элементы.ПереходВыполнил.Важность = ВажностьКнопки.Главная;
		Элементы.ОтправитьВКонтролирующийОрган.Видимость = Ложь;
		
		Элементы.ГруппаПодачиЧерезИнтернетОписание.Видимость = Ложь;
		Элементы.ГруппаПодачиСамостоятельноОписание.Видимость = Истина;
	КонецЕсли;
	
	Если ТекущийСпособСдачи = СпособСдачи Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийСпособСдачи = СпособСдачи;	
КонецПроцедуры

&НаКлиенте
Процедура АнимацияОтправить()
	
	Если ШиринаКнопкиОтправить <= 25 Тогда
		Элементы.ОтправитьВКонтролирующийОрган.Ширина = ШиринаКнопкиОтправить;
		ПодключитьОбработчикОжидания("АнимацияОтправить", 0.2, Истина);
		ШиринаКнопкиОтправить = ШиринаКнопкиОтправить + 5;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТекущуюЗакладку(ЭтаФорма, Объект)
	
	Если Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.ОтчетНеСдан") Тогда
		
		ЭтаФорма.Элементы.СтраницаДекларация.ТекущаяСтраница = ЭтаФорма.Элементы.ЗадачаОзнакомиться;
		
	ИначеЕсли Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Распечатать")
		ИЛИ Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Отправить")
		ИЛИ Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Ознакомиться") Тогда
		
		ЭтаФорма.Элементы.СтраницаДекларация.ТекущаяСтраница = ЭтаФорма.Элементы.РасчетПоСтраховымВзносам;
		ЭтаФорма.Элементы.Далее.КнопкаПоУмолчанию = Ложь;
		ЭтаФорма.Элементы.Далее.Важность = ВажностьКнопки.Обычная;
		Если НЕ Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Отправить") Тогда
			ЭтаФорма.Элементы.ПереходВыполнил.КнопкаПоУмолчанию = Истина; 
			ЭтаФорма.Элементы.ПереходВыполнил.Важность = ВажностьКнопки.Главная;
		Иначе
			ЭтаФорма.Элементы.ОтправитьВКонтролирующийОрган.КнопкаПоУмолчанию = Истина; 
			ЭтаФорма.Элементы.ОтправитьВКонтролирующийОрган.Важность = ВажностьКнопки.Главная;
		КонецЕсли;
		
	ИначеЕсли Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Завершить") Тогда
		
		ЭтаФорма.Элементы.СтраницаДекларация.ТекущаяСтраница = ЭтаФорма.Элементы.ЗадачаПроверена;
		ЭтаФорма.Элементы.ПереходВыполнил.КнопкаПоУмолчанию = Ложь;
		ЭтаФорма.Элементы.Далее.КнопкаПоУмолчанию = Истина;
		ЭтаФорма.Элементы.ПереходВыполнил.Важность = ВажностьКнопки.Обычная;
		ЭтаФорма.Элементы.Далее.Важность = ВажностьКнопки.Главная; 

		
	ИначеЕсли Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Завершено") Тогда
		
		ЭтаФорма.Элементы.СтраницаДекларация.ТекущаяСтраница = ЭтаФорма.Элементы.ЗадачаВыполнена; 
		ЭтаФорма.Элементы.Закрыть.КнопкаПоУмолчанию = Истина;
		ЭтаФорма.Элементы.Закрыть.Важность = ВажностьКнопки.Главная;
		
	ИначеЕсли Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.ПолучитьПодтверждение") Тогда
		
		ЭтаФорма.Элементы.СтраницаДекларация.ТекущаяСтраница = ЭтаФорма.Элементы.ЗадачаОжидатьПодтверждения;
		
	Иначе
		
		ЭтаФорма.Элементы.СтраницаДекларация.ТекущаяСтраница = ЭтаФорма.Элементы.РасчетПоСтраховымВзносам;
		ЭтаФорма.Элементы.ПереходВыполнил.КнопкаПоУмолчанию = Истина;
		ЭтаФорма.Элементы.Далее.КнопкаПоУмолчанию = Ложь; 
		ЭтаФорма.Элементы.ПереходВыполнил.Важность = ВажностьКнопки.Главная;
		ЭтаФорма.Элементы.Далее.Важность = ВажностьКнопки.Обычная;
		
	КонецЕсли;
	
КонецПроцедуры


#Область ПанельОтправкиВКонтролирующиеОрганы

&НаКлиенте
Процедура ОбновитьОтправку(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОбновитьОтправкуИзПанелиОтправки(ЭтаФорма, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаПротоколНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьПротоколИзПанелиОтправки(ЭтаФорма, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНеотправленноеИзвещение(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОтправитьНеотправленноеИзвещениеИзПанелиОтправки(ЭтаФорма, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОтправкиНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьСостояниеОтправкиИзПанелиОтправки(ЭтаФорма, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура КритическиеОшибкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьКритическиеОшибкиИзПанелиОтправки(ЭтаФорма, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура ТекущийСпособСдачиПриИзменении(Элемент)
	
	ПереключитьСпособСдачи(ТекущийСпособСдачи);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура УправлениеКоманднойПанелиФормы()	
	
	ИмяСтраницы = Элементы.СтраницаДекларация.ТекущаяСтраница.Имя;
	
	Если ИмяСтраницы = "РасчетПоСтраховымВзносам" Тогда
		Элементы.НавигацияНачало.Видимость = Истина;   
		Элементы.НавигацияОкончание.Видимость = Ложь;
		Элементы.НавигацияОзнакомится.Видимость = Ложь;   
		Элементы.НавигацияЗадачаПроверена.Видимость = Ложь;
	ИначеЕсли ИмяСтраницы = "ЗадачаВыполнена" Тогда
		Элементы.НавигацияНачало.Видимость = Ложь;   
		Элементы.НавигацияОкончание.Видимость = Истина;
		Элементы.НавигацияОзнакомится.Видимость = Ложь;  
		
		Элементы.Закрыть.КнопкаПоУмолчанию = Истина;
		Элементы.Закрыть.Важность = ВажностьКнопки.Главная;

		Элементы.НавигацияЗадачаПроверена.Видимость = Ложь;
	ИначеЕсли ИмяСтраницы = "ЗадачаОзнакомиться" Тогда
		Элементы.НавигацияНачало.Видимость = Ложь;   
		Элементы.НавигацияОкончание.Видимость = Ложь;
		Элементы.НавигацияОзнакомится.Видимость = Истина;   
		Элементы.НавигацияЗадачаПроверена.Видимость = Ложь;
	ИначеЕсли ИмяСтраницы = "ЗадачаПроверена" Тогда
		Элементы.НавигацияНачало.Видимость = Ложь;   
		Элементы.НавигацияОкончание.Видимость = Ложь;
		Элементы.НавигацияОзнакомится.Видимость = Ложь;   
		Элементы.НавигацияЗадачаПроверена.Видимость = Истина;
		
		Элементы.Далее.КнопкаПоУмолчанию = Истина;
		Элементы.Далее.Важность = ВажностьКнопки.Главная;
	Иначе
		Элементы.НавигацияНачало.Видимость = Ложь;   
		Элементы.НавигацияОкончание.Видимость = Ложь;
		Элементы.НавигацияОзнакомится.Видимость = Ложь;   
		Элементы.НавигацияЗадачаПроверена.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры
